src/Documents/ПлатежиВФСЗН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПлатежиВФСЗН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПлатежиВФСЗН</xr:Item>
				<xr:Item>AccumulationRegister.ПлатежиВБелгосстрах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносы1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносы2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносы3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносы4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносы5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносы6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносы7</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносы8</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносы9</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносы10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносы11</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносы12</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадолженностьБГС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносыБГС1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносыБГС2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносыБГС3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносыБГС4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносыБГС5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносыБГС6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносыБГС7</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносыБГС8</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносыБГС9</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносыБГС10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносыБГС11</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносыБГС12</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Платежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПл</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПлатежиБГС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПл</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ПлатежиВФСЗН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПлатежиВФСЗН</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВФСЗН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПлатежиВБелгосстрах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПлатежиВБелгосстрах</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВФСЗН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыПлатежейВФСЗН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВФСЗН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Задолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Платеж</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПлатежиВФСЗН/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		Движения.ПлатежиВФСЗН.Записывать = Истина;
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			ДобавитьСтрокуПлатежиЗадолж(ВыборкаПоШапкеДокумента, Движения.ПлатежиВФСЗН);
			
			ДобавитьСтрокуПлатежиЗадолжБГС(ВыборкаПоШапкеДокумента, Движения.ПлатежиВБелгосстрах);

			
			
			// получим реквизиты табличной части
			ВыборкаПоНачислениям = СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента).Выбрать();
			
			Пока ВыборкаПоНачислениям.Следующий() Цикл 
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок);
				Если НЕ Отказ Тогда
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуПлатежи(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Движения.ПлатежиВФСЗН);
				КонецЕсли;
			КонецЦикла;
			
			ВыборкаПоНачислениям = СформироватьЗапросПоНачисленияБГС(ВыборкаПоШапкеДокумента).Выбрать();
			
			Пока ВыборкаПоНачислениям.Следующий() Цикл 
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок);
				Если НЕ Отказ Тогда
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуПлатежи(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Движения.ПлатежиВБелгосстрах);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежиВФСЗН.Ссылка,
	|	ПлатежиВФСЗН.ПометкаУдаления,
	|	ПлатежиВФСЗН.Номер,
	|	ПлатежиВФСЗН.Дата,
	|	ПлатежиВФСЗН.Проведен,
	|	ПлатежиВФСЗН.Задолженность,
	|	ПлатежиВФСЗН.ЗадолженностьБГС,
	|	ПлатежиВФСЗН.СуммаВзносы1,
	|	ПлатежиВФСЗН.СуммаВзносы2,
	|	ПлатежиВФСЗН.СуммаВзносы3,
	|	ПлатежиВФСЗН.СуммаВзносы4,
	|	ПлатежиВФСЗН.СуммаВзносы5,
	|	ПлатежиВФСЗН.СуммаВзносы6,
	|	ПлатежиВФСЗН.СуммаВзносы7,
	|	ПлатежиВФСЗН.СуммаВзносы8,
	|	ПлатежиВФСЗН.СуммаВзносы9,
	|	ПлатежиВФСЗН.СуммаВзносы10,
	|	ПлатежиВФСЗН.СуммаВзносы11,
	|	ПлатежиВФСЗН.СуммаВзносы12,
	|	ПлатежиВФСЗН.Организация
	|ИЗ
	|	Документ.ПлатежиВФСЗН КАК ПлатежиВФСЗН
	|ГДЕ
	|	ПлатежиВФСЗН.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "")
	
	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, по которой выполняются начисления!", Отказ, Заголовок);
	КонецЕсли;
			
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Функция СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("Ссылка",		Ссылка);
		
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежиВФСЗНПлатежи.Ссылка,
	|	ПлатежиВФСЗНПлатежи.ДатаПл,
	|	ПлатежиВФСЗНПлатежи.СуммаПл,
	|	ПлатежиВФСЗНПлатежи.НомерСтроки
	|ИЗ
	|	Документ.ПлатежиВФСЗН.Платежи КАК ПлатежиВФСЗНПлатежи
	|ГДЕ
	|	ПлатежиВФСЗНПлатежи.Ссылка = &Ссылка";	
	
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачисления()

Функция СформироватьЗапросПоНачисленияБГС(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("Ссылка",		Ссылка);
		
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежиВФСЗНПлатежи.Ссылка,
	|	ПлатежиВФСЗНПлатежи.ДатаПл,
	|	ПлатежиВФСЗНПлатежи.СуммаПл,
	|	ПлатежиВФСЗНПлатежи.НомерСтроки
	|ИЗ
	|	Документ.ПлатежиВФСЗН.ПлатежиБГС КАК ПлатежиВФСЗНПлатежи
	|ГДЕ
	|	ПлатежиВФСЗНПлатежи.Ссылка = &Ссылка";	
	
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачисления()


Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Платежи"": ";
	
		
	// Дата 
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаПл) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата платежа!", Отказ, Заголовок);
	КонецЕсли;
	
		
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления()

Процедура ДобавитьСтрокуПлатежи(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, НаборЗаписей)
	
	Движение = НаборЗаписей.Добавить();
	Движение.Регистратор        = ВыборкаПоШапкеДокумента.Ссылка;
	Движение.Период             = ВыборкаПоШапкеДокумента.Дата;
	Движение.Дата               = ВыборкаПоНачислениям.ДатаПл;
	Движение.Сумма				= ВыборкаПоНачислениям.СуммаПл;
	Движение.Организация		= ВыборкаПоШапкеДокумента.Организация;
	Движение.Вид	            =  Перечисления.ВидыПлатежейВФСЗН.Платеж;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		
	КонецПопытки; 
	
КонецПроцедуры 


Процедура ДобавитьСтрокуПлатежиЗадолж(ВыборкаПоШапкеДокумента, НаборЗаписей)
	ЗапросЗадолженность = Новый Запрос;
	ЗапросЗадолженность.Текст = 
	"ВЫБРАТЬ
	|	ПлатежиВФСЗН.Период,
	|	ПлатежиВФСЗН.Сумма
	|ИЗ
	|	РегистрНакопления.ПлатежиВФСЗН КАК ПлатежиВФСЗН
	|ГДЕ
	|	ГОД(ПлатежиВФСЗН.Период) = &ПериодГод
	|	И ПлатежиВФСЗН.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВФСЗН.Задолженность)
	|	И ПлатежиВФСЗН.Регистратор <> &Ссылка";
	ЗапросЗадолженность.УстановитьПараметр("ПериодГод", Год(Дата));
	ЗапросЗадолженность.УстановитьПараметр("Ссылка",		Ссылка);
	РезультатЗадолж = ЗапросЗадолженность.Выполнить().Выбрать();
	Если не РезультатЗадолж.Следующий()и ВыборкаПоШапкеДокумента.Задолженность <> 0 Тогда
		Движение = НаборЗаписей.Добавить();
	    Движение.Регистратор        = ВыборкаПоШапкеДокумента.Ссылка;
		Движение.Период             = ВыборкаПоШапкеДокумента.Дата;
		Движение.Дата               = Дата(Дата(СтрЗаменить((Год(ВыборкаПоШапкеДокумента.Дата))," ","")+"0101000000"));
		Движение.Сумма				= ВыборкаПоШапкеДокумента.Задолженность;
		Движение.Организация		= ВыборкаПоШапкеДокумента.Организация;
		Движение.Вид	            =  Перечисления.ВидыПлатежейВФСЗН.Задолженность;
	КонецЕсли;  

	Попытка
		НаборЗаписей.Записать();
	Исключение
		
	КонецПопытки; 
	
КонецПроцедуры 

Процедура ДобавитьСтрокуПлатежиЗадолжБГС(ВыборкаПоШапкеДокумента, НаборЗаписей)
	ЗапросЗадолженность = Новый Запрос;
	ЗапросЗадолженность.Текст = 
	"ВЫБРАТЬ
	|	ПлатежиВФСЗН.Период,
	|	ПлатежиВФСЗН.Сумма
	|ИЗ
	|	РегистрНакопления.ПлатежиВБелгосстрах КАК ПлатежиВФСЗН
	|ГДЕ
	|	ГОД(ПлатежиВФСЗН.Период) = &ПериодГод
	|	И ПлатежиВФСЗН.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВФСЗН.Задолженность)
	|	И ПлатежиВФСЗН.Регистратор <> &Ссылка";
	ЗапросЗадолженность.УстановитьПараметр("ПериодГод", Год(Дата));
	ЗапросЗадолженность.УстановитьПараметр("Ссылка",		Ссылка);
	РезультатЗадолж = ЗапросЗадолженность.Выполнить().Выбрать();
	Если не РезультатЗадолж.Следующий()и ВыборкаПоШапкеДокумента.Задолженность <> 0 Тогда
		Движение = НаборЗаписей.Добавить();
	    Движение.Регистратор        = ВыборкаПоШапкеДокумента.Ссылка;
		Движение.Период             = ВыборкаПоШапкеДокумента.Дата;
		Движение.Дата               = Дата(Дата(СтрЗаменить((Год(ВыборкаПоШапкеДокумента.Дата))," ","")+"0101000000"));
		Движение.Сумма				= ВыборкаПоШапкеДокумента.ЗадолженностьБГС;
		Движение.Организация		= ВыборкаПоШапкеДокумента.Организация;
		Движение.Вид	            =  Перечисления.ВидыПлатежейВФСЗН.Задолженность;
	КонецЕсли;  

	Попытка
		НаборЗаписей.Записать();
	Исключение
		
	КонецПопытки; 
	
КонецПроцедуры
